MyTrello/app/views/lists/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
---
<ul>
	<% @list.tasks.each do |task| %>