MyTrello/app/views/lists/show.html.slim

ul
  - @list.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 4]]