MyTrello/app/controllers/lists_controller.rb

	def index
		@lists = List.all
---
SELECT "lists".* FROM "lists" WHERE (created_at > '2020-11-11')

  def create
  	@list = List.new(list_params)
  	if @list.save
---
INSERT INTO "lists" ("header", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["header", "list1"], ["created_at", "2020-11-08 12:52:58.945209"], ["updated_at", "2020-11-08 12:52:58.945209"]]

  def update
  	@list = List.find(params[:id])
    if @list.update(list_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "header" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["header", "list1 (edited)"], ["updated_at", "2020-11-08 15:23:53.798202"], ["id", 1]]

  def destroy
  	@list = List.find(params[:id])
    @list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]