MyTrello/app/controllers/tasks_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @list = List.find(params[:list_id])