MyTrello/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("header", "description", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["header", "aaaa12"], ["description", "fecw"], ["created_at", "2020-11-22 14:21:58.346071"], ["updated_at", "2020-11-22 14:21:58.346071"], ["list_id", 4]]
---
  def create
    @task = Task.new(task_params.merge(list_id: params[:list_id]))
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "sssss"], ["updated_at", "2020-11-12 14:31:50.459575"], ["id", 11]]
---
  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_list
    @list = List.find(params[:list_id])